Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་གཏོགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ལ། །སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་པ་དང་།
en: The teaching of the entire succession of buddhas and succession of buddha realms in the atoms of all the buddha realms that are included within the entire realm of phenomena.

source: ནམ་མཁའི་དབྱིངས་ཀྱིས་ཀླས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ། །ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་བསྐལ་པར་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་རྗེས་སུ་བརྗོད་པ་བསྟན་པ་དང་།
en: The teaching of describing the qualities of a tathāgata until the end of future kalpas in all the buddha realms to the ends of the element of space.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་སྐྱེ་བ་དང་། མཐའ་དང་དབུས་མེད་པའི་མངོན་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སྒོ་རྒྱ་མཚོ་ཡོངས་སུ་བརྗོད་ཅིང་བསྟན་པ་དང་།
en: The teaching that describes the appearance of tathāgatas in all the buddha realms and the ocean of gateways to enlightenment that have no middle or edge.

source: ནམ་མཁའི་དབྱིངས་ཀྱིས་ཀླས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་སྙིང་པོ་བྱང་ཆུབ་ལ་མངོན་དུ་གྱུར་པའི་གནས་བསྟན་པ་དང་།
en: The teaching of the saṅghas of bodhisattvas, the circles of the assemblies of the tathāgatas, who are facing the bodhimaṇḍas in all the buddha realms to the ends of the element of space. 5.

source: འདི་ལྟ་སྟེ་དུས་གསུམ་གྱི་སངས་རྒྱས་ཀྱི་སྐུ་དང་འདྲ་བར་སྤྲུལ་པ་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས། སེམས་སྐད་ཅིག་ལ་རབ་ཏུ་དགྱེ་ཞིང་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་དགང་བ་བསྟན་པ་དང་།
en: The teaching of emanations that are like the bodies of the buddhas of the three times that are emanated from all the pores in one instant of mind and pervade the realm of phenomena.

source: ཕྱོགས་རྒྱ་མཚོ་ཐམས་ཅད་དུ་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་མཚོ་གཞི་མཉམ་པར་བྱིན་གྱིས་བརླབ་ཅིང་ལུས་གཅིག་གིས་རྒྱས་པར་དགང་བསྟན་པ་དང་།
en: The teaching of the ocean of buddha realms in the ocean of directions being blessed as having the same ground and having one body pervading them.

source: དམིགས་པའི་གཞི་ཐམས་ཅད་ལ་སངས་རྒྱས་ཀྱི་རྣམ་པར་སྤྲུལ་བ་དུས་གསུམ་ཐམས་ཅད་ཡང་དག་པར་གཞོལ་བར་འགྱུར་བའི་བྱིན་གྱི་རླབས་ཡང་དག་པར་བསྟན་པ་དང་།
en: The teaching of the power of buddha manifestations appearing on all supporting surfaces in all three times. 8.

source: འདི་ལྟ་སྟེ་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ལ། དུས་གསུམ་གྱི་ཞིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དང་། བསྐལ་པ་རྒྱ་མཚོ་ཡོངས་སུ་བཤད་ཅིང་བསྟན་པ་དང་།
en: The teaching of the manifestations of the buddhas in the succession of realms, as numerous as the atoms of all realms, throughout the three times in an ocean of kalpas.

source: དུས་གསུམ་གྱི་སངས་རྒྱས་ཀྱི་སྨོན་ལམ་རྒྱ་མཚོ་ཐམས་ཅད་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་རབ་ཏུ་བརྗོད་པ་ཕྱི་མའི་མཐར་བྱིན་གྱིས་བརླབས་པས། བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་འབྱུང་བར་བསྟན་པ་དང་།
en: The teaching of the power of an entire ocean of the prayers of the buddhas of the three times being expressed from all pores and causing the appearance of bodhisattvas.

source: ཆོས་ཀྱི་དབྱིངས་དང་མཉམ་པའི་སེང་གེའི་ཁྲི་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དང་། སྙིང་པོ་བྱང་ཆུབ་ཀྱི་རྒྱན་ཐ་མྱི་དད་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་རྣམ་པ་ཐ་དད་པ་རབ་ཏུ་བསྐོར་བ། ཕྱི་མའི་མཐར་བྱིན་གྱིས་བརླབ་པ་བསྟན་པའོ། །
en: The teaching of the power of buddhas, lion thrones, assembled circles of bodhisattvas, the adornment of the bodhimaṇḍa, and the turning of the different Dharma wheels being as extensive as the realm of phenomena.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དེ་ལྟར་སེང་གེ་རྣམ་པར་བསྒྱིངས་པའི་ཏིང་ངེ་འཛིན་འདི་ལ་བསྟན་པ་བཅུ་པོ་དེ་དག་ལ་སྩོགས་པ་ཤིན་ཏུ་བསྟན་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཡོད་དེ།
en: “Oh jinaputras, the teachings on this samādhi of the gaping lion, such as these ten teachings, are as numerous as the atoms in uncountable buddha realms.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་ལོ། །
en: “Oh jinaputras, that is the field of activity of the wisdom of the tathāgatas.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ཆེན་པོ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་འདི་ཉིད་ཀྱི་དོན་གྱི་ཕྱོགས་བསྟན་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་ཞལ་དུ་ལྟ་ཞིང་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཐམས་ཅད་ལ་རྣམ་པར་བལྟས་ནས། སངས་རྒྱས་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པ་མཐའ་དང་དབུས་མེད་པ་ལ་རྣམ་པར་བལྟས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་བསམ་གྱིས་མི་ཁྱབ་པར་གཞོལ་བ་ལ་རྣམ་པར་བལྟས་ནས་ཡེ་ཤེས་བསམ་གྱིས་མྱི་ཁྱབ་པའི་སྒྱུ་མའི་ཆོས་ཉིད་ལ་རྣམ་པར་བལྟས་ཏེ། དུས་གསུམ་གྱི་སངས་རྒྱས་མཉམ་པ་ཉིད་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་རྣམ་པར་བལྟས་ནས། མཐའ་དང་དབུས་མེད་པའི་ངག་གི་ལམ་དང་ངེས་པའི་ཚིག་དང་། ཆོས་ཀྱི་ཚུལ་ཐམས་ཅད་ལ་རྣམ་པར་བལྟས་ཏེ། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །བ་སྤུ་གཅིག་ལ་རྒྱ་མཚོ་རྒལ་བའི་ཞིང་། །ཞིང་ཀུན་ཤིན་ཏུ་ཕྲ་བའི་རྡུལ་དང་མཉམ། །
en: The bodhisattva Samanta­bhadra, in order to teach an aspect of the meaning of the Tathāgata’s samādhi of the gaping lion, through the blessing of the Buddha looked upon the Tathāgata’s face, looked upon the ocean of the circle of the assembly, looked upon the inconceivable field of activity of the Buddha and the manifestations of the Tathāgata’s samādhi, which have no center or limit, looked at his entry into inconceivable numbers of world realms, looked at the nature of the illusory manifestations of inconceivable wisdom, looked upon the inconceivable equality of the buddhas of the three times, looked upon all his speech, definitions, and ways of the Dharma, which have no center or limit, and recited these verses: “On each body hair there is an ocean of the realms of jinas As numerous as the atoms in all realms.

source: དེ་ནས་སངས་རྒྱས་བྱང་ཆུབ་སེམས་དཔའི་འཁོར། ཀུན་གྱིས་ཡོངས་བསྐོར་སངས་རྒྱས་གདན་ལ་བཞུགས། །
en: There, buddhas are seated on their buddha thrones, Surrounded by assemblies of bodhisattvas.

source: སྤུ་གཅིག་རྩེ་ལ་ཞིང་མང་རྒྱ་མཚོ་རྣམས། །སྙིང་པོ་བྱང་ཆུབ་པདྨོའི་གདན་གནས་པས། །ཆོས་དབྱིངས་རྒྱ་ཆེན་ཡོངས་སུ་རྒྱས་བཀང་ཞིང་། །ཤིང་དྲུང་དམ་པ་ཀུན་ན་མགོན་པོ་སྣང་། །
en: {1} “There appears an ocean of many realms on each body hair, In each of which appears a guide at the foot of the supreme tree, Seated upon a lotus seat on the bodhimaṇḍa, Filling the vastness of the realm of phenomena.

source: ཞིང་རྣམས་ཀུན་གྱི་རྡུལ་ཕྲན་རབ་མང་རྙེད། །རྒྱལ་བ་སྤུ་རྩེ་གཅིག་ལ་ཡོངས་བཞུགས་པ། །
en: {2} “On each single body hair reside jinas As numerous as the atoms in all the realms.

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་ཡོངས་སུ་བསྐོར། །ཀུན་ཀྱང་བཟང་པོའི་སྤྱོད་པ་སྟོན་པ་མཛད། །
en: They are encircled by assemblies of bodhisattvas And all teaching good conduct.

source: ཞིང་མཆོག་གཅིག་ན་རྒྱལ་བ་བཞུགས་གྱུར་ཀྱང་། །བྱང་ཆུབ་སེམས་དཔའི་སྤྲིན་མང་མི་ཟད་པ། དེ་དག་ཕྱོགས་བཅུ་མ་ལུས་ཐམས་ཅད་ནས། །
en: {3} “A jina resides in each supreme realm With as many unending clouds of bodhisattvas, Who filled all infinite realms, having come From all of the ten directions without exception.

source: འབྱམ་ཀླས་ཞིང་ཀུན་བཀང་ཞིང་ཀུན་ཀྱང་འོང་། །ཞིང་རྣམས་བྱེ་བའི་རྡུལ་ཕྲན་མཉམ་པ་ཡི། །བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་རྒྱ་མཚོ་འོད། །ཕྱོགས་བཅུའི་ཆོས་དབྱིངས་རྒྱས་པ་ཀུན་བཀང་ཞིང་། །སྟོན་པ་དེ་ལ་ཀུན་ཀྱང་འཁོར་ནས་ལྡང་། །
en: {4} “Bodhisattvas, shining with an ocean of qualities, As numerous as the atoms in ten million realms, Who filled the realm of phenomena’s ten directions, Have all appeared as the assembly of the teachers.

source: ཞིང་རྣམས་ཀུན་ཏུ་གཟུགས་བརྙན་རབ་ཏུ་སྟོན། །ཆོས་ཀྱི་རྒྱལ་པོ་རྒྱལ་བའི་ཡེ་ཤེས་མཚོ། །
en: {5} “Throughout all realms appear the images Of an ocean of the kings of Dharma, the wisdom of the jinas.

source: དེ་དག་ཀུན་ཀྱང་བཟང་པོའི་སྤྱོད་ལ་གནས། །སངས་རྒྱས་ཀུན་གྱི་འཁོར་དུ་ཉེ་བར་འདོང་། །
en: All who are maintaining good conduct Have come to be the assemblies of all the buddhas.

source: འབྱམ་ཀླས་ཞིང་རྣམས་ཀུན་ན་འཁོད་སྤྱོད་ཅིང་། །བྱང་ཆུབ་སེམས་དཔའི་དགའ་བ་རབ་གནས་ཏེ། །ཆོས་ཀྱི་སྤྲིན་མཉན་དཔའ་བོ་དེ་དག་ནི། །ཞིང་གཅིག་དུ་ཡང་བསྐལ་པ་བྱེ་བར་སྤྱོད། །
en: {6} “Those who maintain the delightful conduct of bodhisattvas, Who dwell throughout all infinite realms, Those heroes who listen to clouds of the Dharma, Practice that conduct for ten million kalpas in each realm.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པར་བྱེད། །ཆོས་ཀྱི་གང་ཆེན་མཚོ་སྤྱོད་རྣམ་པར་སྣང་། །
en: {7} “The bodhisattvas who are practicing their conduct Are radiant with the practice of an ocean of Dharma.

source: སྨོན་ལམ་རྒྱ་མཚོ་ཀུན་ལ་རབ་ཏུ་འཇུག །དེ་དག་སངས་རྒྱས་ས་ཡི་སྤྱོད་ཡུལ་གནས། །
en: They engage in the entire ocean of prayers And remain within the field of conduct of buddhahood.

source: རྒྱལ་བའི་ཆོས་རྣམས་གཞན་དང་གཞན་བྱུང་བའི། །དེ་དག་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ཤེས། །
en: {8} “They who have originated from this and that Dharma of the jinas Have the knowledge of completely good conduct.

source: སངས་རྒྱས་ཡོན་ཏན་ལེགས་པ་རྒྱ་མཚོ་དང་། །རྣམ་པར་འཕྲུལ་པ་རྒྱ་ཆེན་ཡངས་ལ་འཇུག །
en: They enter into the extensive miraculous appearance Of oceans of the excellent qualities of the buddhas.

source: བདེ་གཤེགས་ཆོས་དབྱིངས་ཀུན་ཏུ་རྒྱས་བཀང་ཞིང་། །ཞིང་རྣམས་ཀུན་གྱི་རྡུལ་ཕྲན་ཇི་སྙེད་པའི། །སྐུ་ཡི་སྤྲིན་རྣམས་རྟག་ཏུ་འགྱེད་མཛད་ཅིང་། །ཆོས་ཀྱི་ཆར་གྱིས་བྱང་ཆུབ་རབ་ལ་དགོད།། །།
en: {9} “The sugatas pervade the entirety of the realm of phenomena, Continuously emanating clouds of bodies As numerous as the atoms in all realms, Bringing a rain of Dharma that leads to enlightenment.”

source: སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་ཉི་ཤུ་དྲུག་པ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་འདི་ཉིད་ལ་དེ་བས་ཀྱང་བརྣན་ཏེ། འགོད་པ་མཛད་པའི་དོན་དུ་སྨིན་མཚམས་ཀྱི་མཛོད་སྤུའི་ནང་ནས་ཆོས་ཀྱི་དབྱིངས་སྒོ་ཀུན་ནས་རྣམ་པར་དམིགས་པས་དུས་གསུམ་སྣང་བ་ཞེས་བྱ་བའི་འོད་ཟེར་ཆེན་པོ་འོད་ཟེར་གྱི་འཁོར་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་ལྡན་པ་བཀྱེ་སྟེ།
en: {10} Then the Bhagavat, in order to further establish those bodhisattvas in this samādhi of the gaping lion, emanated from the ūrṇā hair between his eyebrows a great ray of light called illumination of the three times focused on all the entrances into the realm of the Dharma, and he was accompanied by an entourage of light rays as numerous as the atoms in countless buddha realms.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འབྱམ་ཀླས་པ་ཐམས་ཅད་སྣང་བར་མཛད་དོ། །
en: They illuminated all the infinite buddha realms in all the oceans of world realms in the ten directions.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཛེ་ཏའི་ཚལ་དུ་ཚོགས་པ་དེ་དག་གི་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་གཏོགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ནམ་མཁའི་དབྱིངས་ཀྱི་མཐའ་ཀླས་པ་ཐམས་ཅད་དང་། །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའི་ཁོངས་སུ་ཆུད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་དག་ལ། སངས་རྒྱས་ཀྱི་ཞིང་གི་མྱིང་དུ་བྱ་བ་ཁ་དོག་སྣ་ཚོགས་དང་། རྣམ་པ་སྣ་ཚོགས་སུ་རྣམ་པར་དག་པ་དང་། ཞིང་སྣ་ཚོགས་དང་།
en: Then those bodhisattvas who were assembled in Jetavana saw all the buddha realms that were included within the realm of phenomena, which extended to the limits of space, and the buddha realms that were in the atoms of all buddha realms that were as numerous as the atoms in all buddha realms.

source: དབྱིབས་སྣ་ཚོགས་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་སྙིང་པོ་བྱང་ཆུབ་ཏུ་ཕྱིན་ཏེ། སེང་གེའི་ཁྲི་ལ་འདུག་པ་འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱིས་ཤིན་ཏུ་མཆོད་པ། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ཀུན་ནས་བསྐོར་བ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བར་མཐོང་སྟེ།
en: In these buddha realms, which had different names and colors, different levels of purification, different kinds of grounds, and different kinds of appearances, there were those who had come to a bodhimaṇḍa, were seated upon a bodhisattva’s lion throne, were being offered to by the lords of the world, and were encircled by a supreme assembly of bodhisattvas and were attaining the highest, complete enlightenment of buddhahood.

source: ལ་ལ་ན་ནི་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པ་ཙམ་དུ་ཤིན་ཏུ་ཡངས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ན། ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་ཁྱབ་པའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་གྱིས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་མཐོང་ངོ་། །ལ་ལ་ན་ནི་ལྷའི་གནས་ན་འདུག །ལ་ལ་ན་ནི་ཀླུའི་གནས་ན་འདུག །ལ་ལ་ན་ནི་གནོད་སྦྱིན་གྱི་གནས་ན་འདུག །ལ་ལ་ན་ནི་ལྷ་མ་ཡིན་གྱི་གནས་ན་འདུག །ལ་ལ་ན་ནི་ནམ་མཁའ་ལྡིང་གི་གནས་ན་འདུག །ལ་ལ་ན་ནི་མིའམ་ཅིའི་གནས་ན་འདུག །ལ་ལ་ན་ནི་ལྟོ་འཕྱེ་ཆེན་པོའི་གནས་ན་འདུག །ལ་ལ་ན་ནི་མིའི་དབང་པོའི་གནས་ན་འདུག །ལ་ལ་ན་ནི་མིའི་འཇིག་རྟེན་གྱི་གྲོང་དང་།
en: They saw in countless buddha realms some who were turning the wheel of the Dharma with an extent of speech that filled the vastness of the realm of phenomena.

source: གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཁམས་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དག་ན་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་དང་། སྤྱོད་ལམ་སྣ་ཚོགས་དང་། ལུས་སྣ་ཚོགས་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་རྣམ་པར་དམྱིགས་པ་སྣ་ཚོགས་དང་།
en: They saw some who were in the abodes of the devas; some who were in the abodes of the nāgas; some who were in the abodes of the yakṣas; some who were in the abodes of the asuras; some who were in the abodes of the garuḍas; some who were in the abodes of the kinnaras; some who were in the abodes of the mahoragas; some who were in the abodes of lords of humans; some who were in the villages, towns, market towns, districts, countries, and capitals in the world of humans; with various miraculous powers, various conducts, various bodies; demonstrating various entrances to samādhi; with the various clairvoyances of samādhi; appearing in various families and castes; manifesting various colors; having various kinds of asuras; emanating various networks of light rays; having various extents of voice, various humans that are being spoken to, and various audiences for their teaching; and teaching the Dharma to the gathered assemblies with various words, expressions, and definitions.

source: ཏིང་ངེ་འཛིན་གྱི་མངོན་པར་ཤེས་པ་སྣ་ཚོགས་དང་། རིགས་དང་རྒྱུད་སྣ་ཚོགས་སུ་བྱུང་བ་དང་། ཁ་དོག་རྣམ་པར་དམིགས་པ་སྣ་ཚོགས་དང་འོད་ཀྱི་དཀྱིལ་འཁོར་སྣ་ཚོགས་དང་། འོད་ཟེར་གྱི་དྲ་བ་དགྱེ་བ་སྣ་ཚོགས་དང་། དབྱངས་ཀྱི་དཀྱིལ་འཁོར་སྣ་ཚོགས་དང་། གཏམ་གྱི་སྐྱེས་བུའི་གཞི་སྣ་ཚོགས་དང་། བསྟན་པའི་གཞི་སྣ་ཚོགས་དང་། །ཚིག་དང་ཡི་གེ་དང་ངེས་པའི་ཚིག་སྣ་ཚོགས་ཀྱིས་འཁོར་གྱི་དཀྱིལ་འཁོར་སྣ་ཚོགས་ན་ཆོས་སྟོན་པ་མཐོང་བར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་ཇི་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ།
en: As many bodhisattvas as there were saw in each of those gathered assemblies a tathāgata’s profound miracles from a buddha’s samādhi.

source: ནམ་མཁའི་མཐས་གཏུགས་པ་ཕྱོགས་བཅུ་ན་རྣམ་པར་གནས་པ། ཕྱོགས་ཀྱི་རྒྱུད་མཐའ་ཡས་པར་འདུས་པ། ཕྱོགས་རྒྱ་མཚོ་ཐམས་ཅད་དུ་གཏོགས་པ། ཆོས་སྣ་ཚོགས་ཀྱི་སྒོ་དང་ལྡན་པ། ཕྱོགས་ཀྱི་མྱིང་དུ་བྱ་བ་སྣ་ཚོགས་སུ་གཏོགས་པ། ཕྱོགས་སྣ་ཚོགས་ཀུན་ཏུ་གཞོལ་བ། ཕྱོགས་ཆ་རྣམ་པ་ཐ་དད་པར་གཏོགས་པ། ཕྱོགས་སྣ་ཚོགས་ཀྱི་རྗེས་སུ་སོང་བ། ཕྱོགས་རྒྱ་མཚོ་སྣ་ཚོགས་སུ་གཏོགས་པ་འདི་ལྟ་སྟེ། ཤར་ཕྱོགས་དང་། ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། བྱང་དང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་དང་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་དང་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་དང་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཞིང་གི་ལྷུན་གྱི་ཕྱོགས་དང་། སེམས་ཅན་གྱི་ལུས་ཀྱི་ཕྱོགས་དང་། སེམས་ཅན་གྱི་མྱིང་དུ་བྱ་བའི་ཕྱོགས་དང་། སྔོན་གྱི་མཐའི་མུར་ཐུག་པའི་ཕྱོགས་དང་། ཕྱོགས་བཅུའི་ད་ལྟར་བྱུང་བའི་ཕྱོགས་དང་། ནམ་མཁའི་ཁོངས་ཐམས་ཅད་དུ་སྐྲའི་རྩེ་མོ་ཤིན་ཏུ་ཕྲ་བ་དགོད་པས་དམིགས་པའི་ཕྱོགས་དང་། ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་ཕྱོགས་ལ་འཇུག་པ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱོགས་དང་། ལས་ཀྱི་འདུ་བྱེད་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གྲུབ་པའི་ཕྱོགས་དང་། སྐྲའི་རྩེ་མོ་གཅིག་ལ་མཐའ་དང་དབུས་མེད་པའི་ནམ་མཁའི་དབྱིངས་ཀྱི་མྱིང་དུ་བྱར་གཏོགས་པའི་ཕྱོགས་ཀྱི་ཁོངས་སུ་ཆུད་པའི་དུས་གསུམ་གྱི་དབྱིངས་མཉམ་པ་ཉིད་དུ་གཞོལ་བས།
en: They saw the arising of the images of the miracles of the samādhis of tathāgatas in as many world realms as there are throughout the realm of phenomena and as far as the limits of space, that are present in the ten directions, that are all around in the infinite directions, that are in the entire ocean of directions, that are in the directions of various gateways into the Dharma, that are conceived to be in the various directions, that are assembled in the various directions, that are divided among the various directions, that belong to the various directions, that are included within the ocean of the various directions, which means in the eastern direction, in the southern direction, in the western direction, in the northern direction, in the northeastern direction, in the southeastern direction, in the southwestern direction, in the northwestern direction, in the upward direction and the downward direction, in the directions of groups of realms, in the directions of groups of beings, in the directions of the conceived categories of beings, in the directions of the furthest past, in the ten directions of the present, in the directions that are focused on a very fine hair tip located within the entire expanse of space, in the directions of the succession of atoms in all realms, in the directions that are included within directions, in the directions where the creation of various kinds of karma is accomplished, in the directions where space, which has no middle or edge, is perceived as being in a single hair tip, in the minds of beings where the three times are united in the state of equality and all beings are within a state of equality, where there is no differentiation between the perceptions of all beings, and where there is the equality of all sounds.

source: ཀུན་ཏུ་གཏོགས་པའི་འགྲོ་བ་ཐམས་ཅད་ཐ་མྱི་དད་པས། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདུ་ཤེས་ཀྱི་འདུས་ཆེས་ཀྱི་རྣམ་པ་ལ་མཉམ་པའི་སྒྲ་དབྱངས་སུ་གྱུར་པའི་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་ལ་གཟུགས་བརྙན་རབ་ཏུ་སྣང་བར་གྱུར་པའི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་རྣམ་པར་འཕྲུལ་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ལ་མངོན་པར་ལྟ་བ།
en: They saw within the groups of beings the approach of the forms of the tathāgatas before the assemblies that directly perceive them.

source: དམིགས་པར་བྱ་བས་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་འགྲོ་བའི་ཚུལ་དང་ལྡན་པ། བསྐལ་པ་ཐམས་ཅད་ལ་ཡེ་ཤེས་ཐ་མྱི་དད་པ།
en: They saw the sameness of wisdom within all kalpas.

source: ཞིང་ཐམས་ཅད་ལ་ཀུན་ཏུ་སྙོམས་པས་སེམས་ཅན་གྱི་བསམ་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གཟུགས་མངོན་སུམ་དུ་བསྟན་པ་རྣམ་པར་དམིགས་པ་དང་།
en: They saw in all the realms how equally everywhere there was the perception of the appearance before them of the forms of the tathāgatas in accordance with the aspirations of all beings.

source: དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་བ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་བསྟན་པས། སེམས་ཅན་ཐམས་ཅད་འདུལ་བ་རྒྱུན་མི་འཆད་པ་མཐོང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ནི་སྔོན།
en: They saw their teaching of all the Dharmas of the buddhas so that there was a continuous guiding of all beings.

source: བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱིས་དགེ་བའི་སྤྱོད་པ་སྐལ་བ་མཉམ་པ་དང་།
en: They saw the miraculous activities of the tathāgatas.

source: བསྡུ་བའི་དངོས་པོ་བཞིས་ཡོངས་སུ་བསྡུས་པ་མཐོང་བ་དང་མཉམ་པ་དང་།
en: The Bhagavat Vairocana, through the four methods of gathering pupils and through their corresponding previous practice of good actions, had adopted all of them as pupils.

source: རྗེས་སུ་དྲན་པ་དང་བསྙེན་བཀུར་བས་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དག་གོ །
en: They were ripened through teaching, hearing, remembering, and reverence.

source: སྔོན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དུ་བཙུད་པ་དག་གོ །
en: They had in the past developed the aspiration to attain the highest supreme enlightenment.

source: དེ་བཞིན་གཤེགས་པ་དེ་དང་དེ་དག་གི་དྲུང་དུ་གཤེགས་པའི་ཚེ་དགེ་བའི་རྩ་བས་ཡོངས་སུ་བསྡུས་པ་དག་སྟེ།
en: When they had come before this and that tathāgata, they had been adopted as their pupils because of their roots of merit.

source: དེ་ལྟར་དགེ་བའི་རྩ་བ་སྐལ་པ་མཉམ་པས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྨིན་པར་འགྱུར་བའི་ཐབས་ཀྱིས་ཤིན་ཏུ་བཟུང་བའི་ཕྱིར། བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པ་ཆོས་ཀྱི་དབྱིངས་ལྟར་ཡངས་ཤིང་ནམ་མཁའི་དབྱིངས་ཀྱི་མཐས་གཏུགས་པར་གྱུར་བ་དག་ཀྱང་མཐོང་ཞིང་ཁོང་དུ་ཆུད་པར་གྱུར་པ་ཡིན་ཏེ། །
en: In that way, through having the corresponding roots of merit and because they were adopted as pupils through the methods of ripening them for omniscience, they saw and perceived the miracles of the samādhi of the Bhagavat Vairocana, which are vast, extending to the limits of space.

source: ལ་ལ་ནི་ཆོས་ཀྱི་སྐུ་ལ་འཇུག་གོ །
en: Some perceived the Dharma body.

source: ལ་ལ་ནི་གཟུགས་ཀྱི་སྐུ་ལ་འཇུག་གོ །
en: Some perceived the form body.

source: ལ་ལ་ནི་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་བསྒྲུབ་པ་ལ་འཇུག་གོ །
en: Some perceived his past bodhisattva accomplishment.

source: ལ་ལ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པ་ལ་འཇུག་གོ །
en: Some perceived his completion of the perfections.

source: ལ་ལ་ནི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པའི་རྒྱན་ལ་འཇུག་གོ །
en: Some perceived the display of his pure field of conduct.

source: ལ་ལ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་ཡི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་གོ །
en: Some perceived the miracles of the bodhisattva level.

source: ལ་ལ་ནི་མངོན་པར་བྱང་ཆུབ་པའི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་གོ །
en: Some perceived the miracles of enlightenment.

source: ལ་ལ་ནི་སངས་རྒྱས་རྣམ་པར་སྤྱོད་པའི་ཏིང་ངེ་འཛིན་ཐ་མྱི་དད་པའི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་གོ །
en: Some perceived miracles that were not different from the samādhi practiced by a buddha.

source: ལ་ལ་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་མྱི་བསྙེངས་པ་ལ་འཇུག་གོ །
en: Some perceived the strengths and fearlessnesses of the tathāgatas.

source: ལ་ལ་ནི་སངས་རྒྱས་ཀྱི་སོ་སོ་ཡང་དག་པར་རིག་པ་རྒྱ་མཚོ་ལ་འཇུག་གོ །དེ་དག་ལ་སྩོགས་པ་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལ་འཇུག་སྟེ་མོས་པ་སྣ་ཚོགས་དང་ལམ་སྣ་ཚོགས་དང་། སྒོ་སྣ་ཚོགས་དང་། འཇུག་པ་སྣ་ཚོགས་དང་། འབབ་པ་སྣ་ཚོགས་དང་། རྣམ་པ་སྣ་ཚོགས་དང་།
en: Some perceived the ocean of the realization of a buddha, and so on, perceiving an ocean of a buddha’s miracles as numerous as the incalculable number of atoms in ten buddha realms.

source: རྗེས་སུ་འབྲང་བ་སྣ་ཚོགས་དང་། ཕྱོགས་སྣ་ཚོགས་དང་སྣོད་སྣ་ཚོགས་དང་ཡུལ་སྣ་ཚོགས་དང་། འཇིག་རྟེན་སྣ་ཚོགས་དང་ཁོང་དུ་ཆུད་པ་སྣ་ཚོགས་དང་། ཚོགས་སྣ་ཚོགས་དང་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་དང་། ཐབས་སྣ་ཚོགས་དང་ཏིང་ངེ་འཛིན་སྣ་ཚོགས་ཀྱིས་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་དེ་དག་ལ་འཇུག་གོ །ཏིང་ངེ་འཛིན་སྣ་ཚོགས་ཀྱིས་འཇུག་པ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཆོས་ཀྱི་དབྱིངས་ཀུན་ནས་བརྒྱན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དུས་གསུམ་ཐམས་ཅད་ལ་ཐོགས་པ་མེད་པར་ཡུལ་སྣང་བར་བྱེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞི་ཐ་མྱི་དད་པའི་ཡེ་ཤེས་སྣང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དེ་བཞིན་གཤེགས་པའི་ཡུལ་གྱི་དབྱིངས་ལ་འཇུག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ནམ་མཁའི་དབྱིངས་སུ་སྣང་བ་དང་།
en: They perceived an ocean of buddha miracles through various aspirations, various paths, various gateways, various entries, various ingresses, various ways, various observances, various directions, various vessels, various regions, various worlds, various attainments, various accumulations, various miracles, and various methods.
